/*******************************************************************************
* validator.defaults.js -  validator.defaults
* Copyright (C) 2013 
*
* @Author Skiny
* @Email lavenler@live.cn
* @UpdateTime (2013-10-05)
*******************************************************************************/

(function(window,undefined){
	if(validator){
		validator.defaults={
			rules:{
				number:/^\d*$/,
				numberNO:/^[1-9]([0-9])*$/,
				decimal:/^[0-9]+([.]{1}[0-9]+){0,1}$/,
				money:/^(([1-9]+\d*)|([1-9]+\d*\.\d{1,2}))$/,
                hours:/^(([1-9]+\d*)|([1-9]+\d*\.\d{0,1}))$/,
				letters:/^[A-Za-z]+$/,
				chars:/^[A-Za-z0-9_]+$/,
				chinese:/^[\u4e00-\u9fa5]{0,}$/,
				email:/^[\w-]+(\.[\w-]+)*@[\w-]+(\.[\w-]+)+$/,
				telphone:/^(13|15|18)\d{9}$/,
				idcard:/(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/,
				password:/^(?=.*[0-9].*)(?=.*[a-zA-Z].*).{6,20}$/,
				phone:/^((13|15|18)\d{9}|(13|15|18)\d{9}|(\d{7,8})|(\d{4}|\d{3})-(\d{7,8})|(\d{4}|\d{3})-(\d{7,8})-(\d{4}|\d{3}|\d{2}|\d{1})|(\d{7,8})-(\d{4}|\d{3}|\d{2}|\d{1}))$/,
				officephone:/^(\d{7,8})|(\d{4}|\d{3})-(\d{7,8})|(\d{4}|\d{3})-(\d{7,8})-(\d{4}|\d{3}|\d{2}|\d{1})|(\d{7,8})-(\d{4}|\d{3}|\d{2}|\d{1})$/,
				phonecornet:/^\d{1,6}$/,
				ip:	/^(25[0-5]|2[0-4][0-9]|[0-1]{1}[0-9]{2}|[1-9]{1}[0-9]{1}|[1-9])\.(25[0-5]|2[0-4][0-9]|[0-1]{1}[0-9]{2}|[1-9]{1}[0-9]{1}|[1-9]|0)\.(25[0-5]|2[0-4][0-9]|[0-1]{1}[0-9]{2}|[1-9]{1}[0-9]{1}|[1-9]|0)\.(25[0-5]|2[0-4][0-9]|[0-1]{1}[0-9]{2}|[1-9]{1}[0-9]{1}|[0-9])$/,
				url:new RegExp("^(http|https|ftp)\://([a-zA-Z0-9\.\-]+(\:[a-zA-Z0-9\.&amp;%\$\-]+)*@)*((25[0-5]|2[0-4][0-9]|[0-1]{1}[0-9]{2}|[1-9]{1}[0-9]{1}|[1-9])\.(25[0-5]|2[0-4][0-9]|[0-1]{1}[0-9]{2}|[1-9]{1}[0-9]{1}|[1-9]|0)\.(25[0-5]|2[0-4][0-9]|[0-1]{1}[0-9]{2}|[1-9]{1}[0-9]{1}|[1-9]|0)\.(25[0-5]|2[0-4][0-9]|[0-1]{1}[0-9]{2}|[1-9]{1}[0-9]{1}|[0-9])|localhost|([a-zA-Z0-9\-]+\.)*[a-zA-Z0-9\-]+\.(com|edu|gov|int|mil|net|org|biz|arpa|info|name|pro|aero|coop|museum|[a-zA-Z]{2}))(\:[0-9]+)*(/($|[a-zA-Z0-9\.\,\?\'\\\+&amp;%\$#\=~_\-]+))*$")
			},
			messages:{
				required:"此字段为必填项。",
				numberNO:"请输入非零整数",
				minLength:"至少需要输入【{minLength}】个字符，已输入【{inputlength}】个字符。",
				maxLength:"最多允许输入【{maxLength}】个字符，已输入【{inputlength}】个字符。",
				number:"请输入正整数。",
				decimal:"请输入整数或者小数。",
				money:"请输入金额，精确到小数点后两位。",
                hours:"请输入数字，精确到小数点后一位。",
				letters:"请输入由字母(不区分大小写)组成的字符串。",
				chars:"请输入由字母(不区分大小写)、数字、下划线组成的字符串。",
				chinese:"请输入中文。",
				email:"请输入有效的电子邮箱地址。",
				telphone:"请输入有效的手机号码。",
				idcard:"请输入有效的身份证号码。",
				phone:"请输入有效的电话号码。",
				officephone:"请输入有效的座机号码",
				phonecornet:"请输入有效的手机短号",
				ip:"请输入有效的ip地址",
				url:"请输入有效的网址。",
				authFunc:"自定义验证函数有错误，请检查。",
				password:"密码长度为6-20位，必须同时具备字母和数字。"
			}
		};
	}
})(window);